#+title: Notebook 01

* Notebook 01
** Arithmatic with vectors
Import numpy
#+begin_src jupyter-python :session vectors :results none
import numpy as np
import sys
import traceback
#+end_src

Now some vectors
#+begin_src jupyter-python :session vectors :results none
a = np.array([20,40,60])
b = np.array([10,20,30])
c = np.array([5,10,15,20])
#+end_src

Adding vectors of similar dimensions.
#+begin_src jupyter-python :session vectors :results value
a + b
#+end_src

#+RESULTS:
: array([30, 60, 90])

Adding vectors of disimilar vectors will throw exceptions.
#+begin_src jupyter-python :session vectors :results value
a + c
#+end_src

#+RESULTS:
:RESULTS:
# [goto error]
: [0;31m---------------------------------------------------------------------------[0m
: [0;31mValueError[0m                                Traceback (most recent call last)
: Cell [0;32mIn[10], line 1[0m
: [0;32m----> 1[0m a [38;5;241m+[39m c
:
: [0;31mValueError[0m: operands could not be broadcast together with shapes (3,) (4,)
:END:
